var table = {"チキンおろしだれ":[2.7,1.5,1.2,458,1.4],
"チーズインハンバーグ":[0.8,2.0,2.3,476,2.6],
"とんかつ":[1.7,0.1,4.1,476,3.3],
"豚しゃぶポン酢":[2.5,0.1,0.1,235,0.8],
"豚と茄子のみそ炒め":[0.9,0.4,1.6,213,0.6],
"ささみチーズカツ":[1.1,0.0,1.7,224,0.8],
"ブリの照り焼き":[2.0,0.0,0.3,179,1],
"豚生姜焼き":[3.4,0.2,0.2,234,1.2],
"揚げだし野菜":[0.6,0.7,0.7,171,1.4],
"サバ塩焼き":[2.7,0.0,0.0,319,2.3],
"肉じゃが":[0.9,1.1,0.2,161,1.1],
"旨辛豆腐":[0.9,0.1,0.5,133,1.8],
"白身フライのマリネ":[0.3,0.1,3.7,328,1.4],
"だしジュレ半熟卵":[1.0,0.6,0,143,0.8],
"冷やしトマト":[0.0,0.3,0.0,24,0],
"夏のバランス惣菜":[0.0,0.3,0.1,51,0.7],
"揚げ出し豆腐":[0.9,0.1,1.4,182,0.8],
"おくらキムチ和え":[0.0,0.2,0.1,25,0.8],
"ほうれん草の胡麻和え":[0.0,0.3,0.1,28,0.4],
"揚げ餃子":[0.1,0.1,0.7,74,0,2],
"五目ひじき":[0.0,0.1,0.3,20,0.4],
"煮卵":[0.5,0.0,0.5,76,0.6],
"半熟卵":[1.0,0.0,0.0,83,0.2],
"牛とろコロッケ":[0.1,0.1,1.8,157,0.4],
"冷や奴":[0.7,0.0,0.0,63,0],
"きんぴらごぼう":[0.0,0.2,0.3,43,0.4],
"モロヘイヤとオクラのお浸し":[0.0,0.2,0.1,17,0.4],
"カボチャ煮":[0.0,0.3,0.3,59,0.5],
"チキンシーザー風サラダ":[0.4,0.3,0.8,115,0.9],
"ポテト&コーンサラダ":[0.0,0.5,0.6,87,0.6],
"ライス小":[0.0,0.0,2.3,221,0],
"ライス中":[0.0,0.0,4.3,340,0],
"ライス大":[0.0,0.0,5.7,459,5.7],
"麦ご飯小":[0.0,0.0,2.6,206,0],
"麦ご飯中":[0.0,0.0,4.1,321,0],
"麦ご飯大":[0.0,0.0,4.1,321,0],
"特選ハンバーグ丼小":[0.9,0.1,5.3,560,1.6],
"特選ハンバーグ丼中":[0.9,0.1,6.8,682,2.3],
"特選ハンバーグ丼大":[1.6,0.3,6.7,801,3.4],
"カツたま丼小":[0.7,0.0,5.8,557,1.9],
"カツたま丼中":[1.1,0.0,8.3,797,2.8],
"カツたま丼大":[1.4,0.0,10.7,1037,3.7],
"さらさらトン茶":[1.4,0.2,6.9,652,4.7],
"さらさらトン茶大":[1.4,0.2,8.6,790,5.3],
"豚みそ焼き肉丼小":[3.0,0.2,4.3,547,1.3],
"豚みそ焼き肉丼中":[4.3,0.3,6.0,767,1.8],
"豚みそ焼き肉丼大":[5.5,0.3,7.7,988,2.4],
"カレーライス小":[0.1,0.0,5.3,446,3.4],
"カレーライス中":[0.4,0.0,7.0,585,3.8],
"カレーライス大":[0.5,0.0,9.0,744,4.6],
"カツカレー小":[1.7,0.0,7.8,732,4.1],
"カツカレー中":[1.8,0.0,9.5,871,4.5],
"カツカレー大":[1.9,0.0,11.4,1030,5.3],
"冷やしラーメン":[0.4,0.1,6.0,563,7.9],
"冷やしラーメン大":[0.4,0.1,8.2,750,8.4],
"冷やし担々麺":[0.4,0.3,7.3,668,6],
"冷やし担々麺大":[0.4,0.3,9.5,855,6.5],
"味噌ラーメン":[0.4,0.6,6.8,694,10.9],
"味噌ラーメン大":[0.4,0.6,9.0,882,11.4],
"冷やしネバネバそば":[1.0,0.5,3.8,426,2.5],
"釜玉そば":[1.0,0.1,4.9,509,2.6],
"かき揚げそば":[0.0,0.3,6.1,526,4.6],
"冷やしネバネバうどん":[1.0,0.5,3.5,448,4.1],
"釜玉うどん":[1.0,0.1,4.6,531,4.3],
"かき揚げうどん":[0.0,0.3,5.7,537,5.9],
"小豚汁":[0.4,0.1,0.4,79,1.5],
"豚汁":[0.7,0.1,0.7,131,2.5],
"豆腐とわかめの味噌汁":[0.0,0.0,0.3,23,1.7]
};



document.querySelector("#start").onclick = function() {
  var menu_1= document.getElementById("number_1");
      menu_2= document.getElementById("number_2");
      menu_3= document.getElementById("number_3");
      
  console.log(menu_1);
  console.log(menu_2);
  console.log(menu_3);

  var data_1 = table[menu_1.value]
      data_2 = table[menu_2.value]
      data_3 = table[menu_3.value]

  console.log(data_1)
  console.log(data_2)
  console.log(data_3)

  var t = [data_1[0] + data_2[0] + data_3[0], data_1[1] + data_2[1] + data_3[1], data_1[2] + data_2[2] + data_3[2],
   data_1[3] + data_2[3] + data_3[3], data_1[4] + data_2[4] + data_3[4]]
  console.log(t)

  var T = [t[0]/2*5, t[1]/1*5, t[2]/6*5]

  var rc = new html5jp.graph.radar("sample");
  if( ! rc ) { return; }
  var items = [
    ["目標値", 5, 5, 5],
    ["あなたの値", T[0], T[1],T[2]]
    ];
  var params = {
    aCap: ["赤", "緑", "黄"]
  }
  rc.draw(items, params);
};
